In [1]:
import sqlite3
import pandas as pd

In [8]:
%load_ext sql

In [24]:
conn=sqlite3.connect('chicagocrime.db')
data=pd.read_csv('chicagocrime.csv')
conn=sqlite3.connect('chicagocensus.db')
df=pd.read_csv('chicagocensus.csv')
conn=sqlite3.connect('chicagopublicshools.db')
df1=pd.read_csv('chicagopublicschools.csv')

In [25]:
data.to_sql('chicagocrime',conn,if_exists='replace',index=False)
df.to_sql('chicagocensus',conn, if_exists='replace',index=False)
df1.to_sql('chicagopublicschools',conn,if_exists='replace',index=False)

C:\Users\amini\AppData\Roaming\Python\Python39\site-packages\pandas\core\generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [90]:
df

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT_OF_HOUSING_CROWDED,PERCENT_HOUSEHOLDS_BELOW_POVERTY,PERCENT_AGED_16__UNEMPLOYED,PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA,PERCENT_AGED_UNDER_18_OR_OVER_64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3.0,Uptown,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4.0,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0
...,...,...,...,...,...,...,...,...,...
73,74.0,Mount Greenwood,1.0,3.4,8.7,4.3,36.8,34381,16.0
74,75.0,Morgan Park,0.8,13.2,15.0,10.8,40.3,27149,30.0
75,76.0,O'Hare,3.6,15.4,7.1,10.9,30.3,25828,24.0
76,77.0,Edgewater,4.1,18.2,9.2,9.7,23.8,33385,19.0
77,NaN,CHICAGO,4.7,19.7,12.9,19.5,33.5,28202,NaN

In [88]:
dfresult=pd.read_sql_query("SELECT COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME FROM chicagocensus WHERE COMMUNITY_AREA_NUMBER=25",conn)
dfresult

   COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME
0                   25.0              Austin

### The total number of crimes

In [94]:
result1=pd.read_sql_query("SELECT COUNT() as COUNT FROM chicagocrime", conn)
result1

   COUNT
0    533

### The list of community areas where per capita is less than 11000

In [44]:
query1=pd.read_sql_query("SELECT COMMUNITY_AREA_NAME FROM chicagocensus WHERE PER_CAPITA_INCOME<11000 ",conn)
query1

  COMMUNITY_AREA_NAME
0  West Garfield Park
1      South Lawndale
2         Fuller Park
3           Riverdale

### The list of all case numbers for crimes involving Minors

In [52]:
query2=pd.read_sql_query("SELECT DISTINCT CASE_NUMBER FROM chicagocrime WHERE description LIKE '%MINOR'",conn)
query2

  CASE_NUMBER
0    HL266884
1    HK238408

### The list of all kidnapping crimes involving a child

In [51]:
query3=pd.read_sql_query("SELECT CASE_NUMBER,DATE, PRIMARY_TYPE FROM chicagocrime WHERE PRIMARY_TYPE LIKE '%KIDNAPPING'",conn)
query3

  CASE_NUMBER        DATE PRIMARY_TYPE
0    HN144152  2007-01-26   KIDNAPPING

### The list of  crimes recorded at school

In [59]:
query4=pd.read_sql_query("SELECT DISTINCT (PRIMARY_TYPE), LOCATION_DESCRIPTION FROM chicagocrime WHERE LOCATION_DESCRIPTION LIKE'%SCHOOL%'",conn)
query4

             PRIMARY_TYPE       LOCATION_DESCRIPTION
0                 BATTERY    SCHOOL, PUBLIC, GROUNDS
1                 BATTERY   SCHOOL, PUBLIC, BUILDING
2         CRIMINAL DAMAGE    SCHOOL, PUBLIC, GROUNDS
3               NARCOTICS    SCHOOL, PUBLIC, GROUNDS
4               NARCOTICS   SCHOOL, PUBLIC, BUILDING
5                 ASSAULT    SCHOOL, PUBLIC, GROUNDS
6       CRIMINAL TRESPASS    SCHOOL, PUBLIC, GROUNDS
7  PUBLIC PEACE VIOLATION  SCHOOL, PRIVATE, BUILDING
8  PUBLIC PEACE VIOLATION   SCHOOL, PUBLIC, BUILDING

###  The average safety score for each each type of school

In [64]:
query5=pd.read_sql_query("SELECT 'Elementary,Middle,or High School', AVG(SAFETY_SCORE) FROM chicagopublicschools GROUP BY 'Elementary,Middle,or High School'",conn)
query5

  'Elementary,Middle,or High School'  AVG(SAFETY_SCORE)
0   Elementary,Middle,or High School          49.504873

### The list of 5 community area with the highest percent household poverty

In [78]:
query6=pd.read_sql_query("SELECT COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM chicagocensus ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5", conn)
query6

  COMMUNITY_AREA_NAME  PERCENT_HOUSEHOLDS_BELOW_POVERTY
0           Riverdale                              56.5
1         Fuller Park                              51.2
2           Englewood                              46.6
3      North Lawndale                              43.1
4  East Garfield Park                              42.4

### The community area number  with the most crime prone

In [84]:
query7=pd.read_sql_query("SELECT COMMUNITY_AREA_NUMBER, COUNT(COMMUNITY_AREA_NUMBER)AS FREQUENCY FROM chicagocrime GROUP BY COMMUNITY_AREA_NUMBER ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC LIMIT 1",conn)
query7

   COMMUNITY_AREA_NUMBER  FREQUENCY
0                   25.0         43

###  A sub query to list the community area with the highest hardship index

In [92]:
query8=pd.read_sql_query("SELECT COMMUNITY_AREA_NAME FROM chicagocensus WHERE HARDSHIP_INDEX=(SELECT MAX(HARDSHIP_INDEX)FROM chicagocensus) ",conn)
query8

  COMMUNITY_AREA_NAME
0           Riverdale

### Using sub-queries( multiple table) to list the community area name with the most crime

In [93]:
query9=pd.read_sql_query("SELECT COMMUNITY_AREA_NAME FROM chicagocensus WHERE COMMUNITY_AREA_NUMBER=(SELECT COMMUNITY_AREA_NUMBER FROM chicagocrime GROUP BY COMMUNITY_AREA_NUMBER ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC LIMIT 1) LIMIT 1",conn)
query9

  COMMUNITY_AREA_NAME
0              Austin